In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn as sk
%matplotlib notebook
%matplotlib inline

In [ ]:
# pclass = ticket class, SibSp= siblings and spouses, Parch = parents and children

In [2]:
df = pd.read_csv("train.csv")
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
# renaming passengerid column as id and assinging it as the index

In [6]:
df.rename(columns={"PassengerId":"ID"}, inplace=True)

In [8]:
print(df.isnull().sum())

ID            0
Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [9]:
df.shape

(891, 12)

In [12]:
df.drop("Cabin", axis=1, inplace=True)

In [13]:
df.head(10)

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C

In [16]:
df.dropna(axis=0, inplace=True)

In [17]:
df.shape

(712, 11)

### Exploring the data column by column

In [24]:
df["Embarked"].value_counts()

S    554
C    130
Q     28
Name: Embarked, dtype: int64

In [25]:
df.drop("Ticket", axis=1, inplace=True)

In [26]:
df.head(5)

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [27]:
# putting survived column towards the end

In [28]:
df.columns

Index(['ID', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked'],
      dtype='object')

In [29]:
df = df[['ID', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked', 'Survived']]

In [30]:
df.head(5)

,ID,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [31]:
df.set_index("ID", inplace=True)

In [32]:
df.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [42]:
corr_mat = df.corr()

In [43]:
corr_mat["Survived"].sort_values(ascending=False)

Survived    1.000000
Fare        0.266100
Parch       0.095265
SibSp      -0.015523
Age        -0.082446
Pclass     -0.356462
Name: Survived, dtype: float64

### pclass and fare are our best features

In [60]:
df1 = df.loc[df["Pclass"]==1]

In [61]:
df1.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,S,0

In [51]:
df2 = df.loc[df["Pclass"]==2]

In [52]:
df2.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,C,1
16,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,16.0000,S,1
21,2,"Fynney, Mr. Joseph J",male,35.0,0,0,26.0000,S,0

In [53]:
df3 = df.loc[df["Pclass"]==3]

In [54]:
df3.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.250,S,0
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.925,S,1
5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.050,S,0

In [65]:
df1["Pclass"] = 2

<ipython-input-65-a2026aa7c472>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Pclass"] = 2

In [66]:
df1.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
4,2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
7,2,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,S,0

In [67]:
df1["Pclass"].value_counts()

2    184
Name: Pclass, dtype: int64

In [68]:
df3["Pclass"] = 0

<ipython-input-68-b8b46efc74ce>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["Pclass"] = 0

In [69]:
df3["Pclass"].value_counts()

0    355
Name: Pclass, dtype: int64

In [70]:
df2["Pclass"] = 1

<ipython-input-70-4ecb2dc5a009>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Pclass"] = 1

In [71]:
df2["Pclass"].value_counts()

1    173
Name: Pclass, dtype: int64

In [73]:
frames = [df1, df2, df3]

In [74]:
ndf = pd.concat(frames)

In [75]:
ndf.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
4,2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
7,2,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,S,0
12,2,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,S,1
24,2,"Sloper, Mr. William Thompson",male,28.0,0,0,35.5000,S,1

In [76]:
ndf.shape

(712, 9)

In [77]:
ndf.sort_index(inplace=True)

In [78]:
ndf.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
3,0,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
4,2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
5,0,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [79]:
df = ndf

In [80]:
df.head(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
ID,,,,,,,,,
1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
3,0,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
4,2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
5,0,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [81]:
corr_mat = df.corr()

In [82]:
corr_mat["Survived"].sort_values(ascending=False)

Survived    1.000000
Pclass      0.356462
Fare        0.266100
Parch       0.095265
SibSp      -0.015523
Age        -0.082446
Name: Survived, dtype: float64

In [ ]:
# trying a new column modification: total family size as sum of two columns Parch and SibSp

In [84]:
df["fam"] = df["SibSp"] + df["Parch"]

In [85]:
df.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,fam
ID,,,,,,,,,,
1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0,1
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1,1
3,0,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1,0

In [88]:
corr_mat = df.corr()

In [91]:
corr_mat["Survived"].sort_values(ascending=False)

Survived    1.000000
Pclass      0.356462
Fare        0.266100
Parch       0.095265
fam         0.045068
SibSp      -0.015523
Age        -0.082446
Name: Survived, dtype: float64

In [92]:
# we havent encoded male and female labels

In [98]:
import csv

### PAUSE

In [99]:
df.to_csv("E:\")

SyntaxError: EOL while scanning string literal (<ipython-input-99-46005ca48485>, line 1)

### Final step in data cleaning process, getting rid of what we do not need, i.e. all features except Pclass and Fare

In [90]:
df.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked',
       'Survived', 'fam'],
      dtype='object')